app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def index
    @subjects = Subject.all

INSERT INTO "subjects" ("course_code", "course_name", "section", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course_code", "MTHS001"], ["course_name", "College Algebra"], ["section", "N1"], ["created_at", 2017-01-31 05:18:46 UTC], ["updated_at", 2017-01-31 05:18:46 UTC]]
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 3]]
---
  def destroy
    @subject.destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_subject
      @subject = Subject.find(params[:id])